In [1]:
import numpy as np
import pandas as pd

## DataFrame - ***is a 2D data structure***

### Create DataFrame

In [2]:
df = pd.DataFrame({'Col1':['a','b','c','d','e','f','g','h'],
                  'Col2':[1,3,5,7,9,11,13,15]}, columns=['Col1', 'Col2'])

In [3]:
df

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

### DataFrame info

In [4]:
# shape
df.shape

(8, 2)

In [5]:
# Columns names
df.columns

Index(['Col1', 'Col2'], dtype='object')

In [6]:
# index info (start, to, step)
df.index

RangeIndex(start=0, stop=8, step=1)

In [7]:
# similar to mySQL command 'DESC table_name'
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    8 non-null      object
 1   Col2    8 non-null      int64
dtypes: int64(1), object(1)
memory usage: 256.0+ bytes

In [8]:
# min, max, avg, qty, mean, all in one table
df.describe()

            Col2
count   8.000000
mean    8.000000
std     4.898979
min     1.000000
25%     4.500000
50%     8.000000
75%    11.500000
max    15.000000

### Display couple first rows of data

In [9]:
# head(number_of_rows) Default 5
df.head()

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9

### Display specific column

Version_1

In [10]:
# head(number_of_rows)
df['Col1'].head(8)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
Name: Col1, dtype: object

Version_2

In [11]:
# head(number_of_rows)
df.Col1.head(8)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
Name: Col1, dtype: object

### Display couple rows from end

In [12]:
# tail(number_of_rows)
df.tail(3)

  Col1  Col2
5    f    11
6    g    13
7    h    15

## Change index Value

In [13]:
df.index = [2,4,6,8,10,12,14,16]
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

### Pick the value using ***INDEX***   , loc[ index, column]

In [14]:
# loc[index, column]
df.loc[2, 'Col1']

'a'

### Use slice

In [15]:
# SELECT * FROM df WHERE id = 2;
df.loc[2, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [16]:
df.loc[2:4, :]

  Col1  Col2
2    a     1
4    b     3

### Pick the value using ***ROW_NUM***, iloc[ row_no, column]

In [17]:
# Select 1st row within all columns
df.iloc[0, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [18]:
# [from : to, all] 'from is not included'
df.iloc[0:2, :]

  Col1  Col2
2    a     1
4    b     3

Select value from specific column

In [19]:
# [from_r : to_r, from_c]
df.iloc[0:2, 0]

2    a
4    b
Name: Col1, dtype: object

### Select using Conditions

In [20]:
# Display row in all all columns, where col1 contains 'b'
df.loc[df['Col1'] == 'b', :]

  Col1  Col2
4    b     3

In [21]:
# Display value of Col2 where Col1 contains 'b'
df.loc[df['Col1'] == 'b', 'Col2']

4    3
Name: Col2, dtype: int64

In [22]:
# Select * from Col1 where Col2 value > 10
df.loc[df['Col2'] > 10, 'Col1']

12    f
14    g
16    h
Name: Col1, dtype: object

### Display data as np.array

In [23]:
df.loc[df['Col1'] == 'b', 'Col2'].values

array([3])

## AND / OR

In [24]:
#  (Conditions) & (Conditions)
df.loc[(df['Col2'] > 10) & (df['Col1'] != 'g'), :]

   Col1  Col2
12    f    11
16    h    15

In [25]:
# df.loc[ (Conditions) | (Conditions) ]
df.loc[ (df['Col2'] > 10) | (df['Col2'] % 9 == 0), : ]

   Col1  Col2
10    e     9
12    f    11
14    g    13
16    h    15

### .between()

In [26]:
# Select * fron df where col2 value is between 11 and 13 INCLUDED
df.loc[df['Col2'].between(11, 13), :]

   Col1  Col2
12    f    11
14    g    13

### .isin()

In [27]:
# Select * from Col1 Where Value = to the list value
df.loc[ df['Col1'].isin( ['a','b','c','d','e'] ), : ]

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9

### is not in

In [28]:
# Select * from Col1 Where Value != to the list value............[ ~ -> != ]
df.loc[ ~df['Col1'].isin( ['a','b','c','d','e'] ), : ]

   Col1  Col2
12    f    11
14    g    13
16    h    15

### .query()

Show table that working with

In [29]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [30]:
# inside '' use "" -> '2 + 4 = "6" '
df.query('Col1 == "b"')

  Col1  Col2
4    b     3

In [31]:
df.query('Col2 > 10')

   Col1  Col2
12    f    11
14    g    13
16    h    15

## Data as Series from DataFrame

In [32]:
s = df['Col1']
s

2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h
Name: Col1, dtype: object

Show type

In [33]:
type(s)

pandas.core.series.Series

## Get DataFrame from Series

In [34]:
df2 = pd.DataFrame(s)
df2

   Col1
2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h

## Copy DataFrame

In [35]:
# as numpy.arrays
df_copy = df.copy()

### .sample()

In [36]:
# Randomly pick rows from DataFrame (n = row_no)
df.sample(n = 2)

   Col1  Col2
12    f    11
2     a     1

### Selection of a proportion from the DataFrame

.sample() with 'frac'

In [37]:
# 0.5 = half of DataFrame size
df.sample(frac = 0.5)

   Col1  Col2
4     b     3
14    g    13
10    e     9
2     a     1

.sample() with 'frac' and 'replace'

In [38]:
# Display random rows from half of DataFrame size [ rows can be repeated ]
df.sample(frac = 0.5, replace = True)

   Col1  Col2
4     b     3
4     b     3
16    h    15
2     a     1

.sample() with 'row_no' and 'random_state'

In [39]:
df.sample(n = 5, random_state = 42)

   Col1  Col2
4     b     3
12    f    11
2     a     1
16    h    15
6     c     5

## Save and Read from file

DataFrame can be stored as: to_csv, to_exel, to_pickle

In [40]:
# Store DataFrame into file without indexes
df.to_csv( 'Test.csv', sep = ';', index = False ) # Default ','

DataFrame can be read as: read_csv, read_exel, read_pickle

In [41]:
# Read from file 'Test.csv' and store data in DataFrame
df_new = pd.read_csv( 'Test.csv', sep = ';' )

Display data from file

In [42]:
df_new

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15